/*
1. 한 배에는 탈 수 있는 인원이 정시에는 25명, 10분다마 15명씩
탈수 있습니다.
2. 배는 매일 9시부터 21시 전까지(21시를 포함 X) 10분 단위로
들어옵니다.
3. 전체 대기 인원은 14,000,605명입니다. 우리는 14,000,606번째와
14,000,607번째에 배를 타게 됩니다. 앞 사람이 아프거나, 대기를 못하고
빠질 경우 대기인원이 줄어들 수 있습니다. 라이캣과 자바독이 다른배를
타야할 경우에는 뒷배를 타야합니다.
4. 1월은 1024일, 2월은 512일, 3월은 256일, 4월은 128일, 5월은
64일, 6월은 32일, 7월은 16일, 8월은 8일, 9월은 4일, 10월은 2일이며
10월까지 밖에 없습니다. 
5. 시간의 개념은 동일합니다.(하루는 24시간, 1시간 60분, 1분 60초) 
=> 현재 날짜는 2020년 1월 1일 입니다.
6. 배에 타는 순간 자바독이 화장실이 급하다 하여 화장실에 갔으며
현재 시간에 '분'만큼 배 출발이 늦어졌습니다.
7. 배는 휴일도 동일하게 운항됩니다. 배는 천지지변에 영향을 받지
않습니다. 마법으로 날아다니거든요.
8. 라이캣과 자바독이 배에 타는 날짜를 구하세요.*/

